#+title:  Inducción al curso de Estructuras de datos

**** If
- Crea bifurcaciones en el flujo de control, de acuerdo a condiciones referentes al estado del programa
#+begin_src python :session *py* :results output :exports both :tangle /tmp/test.py
   # Forma
   if expresion_booleana:
       sentencias_y_expresiones
   elif otra_expresion_booleana: # elif es opcional, puede haber varios
       sentencias_y_expresiones
   else: # opcional, debe ir al final
       sentencias_y_expresiones      
#+end_src
#+begin_src python :session *py* :results output :exports both :tangle /tmp/test.py
  # Ejemplos
  if True:
      print('entra al if')
#+end_src

#+RESULTS:
: entra al if

#+begin_src python :session *py* :results output :exports both :tangle /tmp/test.py

  if 3 < 2 or True:
      print('entra a if')
  elif 6 == 6.0:
          print('entra al primer elif')
  elif 5 > 3:
      print('entra al segundo elif')
  else:
      print('entra al else')

#+end_src

#+RESULTS:
: entra a if

#+begin_src python :session *py* :results output :exports both :tangle /tmp/test.py
  l = [1, 3, 5, 6]
  if 5 in l:
      print('está el 5')
  else:
      print('no está el elemento')
#+end_src

#+RESULTS:
: está el 5

**** While
- Para crear bucles en el flujo de control
- Permite repetir instrucciones de acuerdo a una condición lógica
- El cuerpo de la sentencia debería provocar que eventualmente la
  condición sea falsa (a menos que se quiera un ciclo infinito)
- Es el tipo más general de bucle (pude comportarse igual que un for)

#+begin_src python :session *py* :results output :exports both :tangle /tmp/test.py
    # Forma
  while expresion_booleana: # se itera mientras True
      sentencias_y_expresiones 
#+end_src  
- Dentro de bucles (tanto while como for), pueden usarse las
  sentencias especiales =break= y =continue=
- =break= causa que se rompa el ciclo sin importar la condición
  lógica.
- Notar que =return= (visto más adelante para terminar
  funciones), también rompe los ciclos, aunque también termina toda la
  función
  #+begin_src python :session *py* :results output :exports both :tangle /tmp/test.py
    x = 0
    while True: # ciclo infinito
        print(x)
        if x > 2:
            break
        x += 1
  #+end_src
#+RESULTS:
: 0
: 1
: 2
: 3

- =continue= por su parte hace que el ciclo se vaya a la siguiente
  iteración

  #+begin_src python :session *py* :results output :exports both :tangle /tmp/test.py
    # sólo imprimir impares
    x = 0
    while x < 10:
        x += 1
        if x % 2 == 0: # es par
            continue
        print(x)    
  #+end_src

#+RESULTS:
: 1
: 3
: 5
: 7
: 9

#+RESULTS:
: 1
: 3
: 5
: 7
: 9
: 11

**** For
- Es un tipo especial de bucle pensado para recorrer estructuras de
  datos lineales
- No debería usarse para otra cosa, para otros casos está =while=
- En general, existen dos tipos de =for= en los lenguajes de
  programación:
  + =Estilo C=: tres partes: sentencia a ejecutar antes de entrar al
    ciclo, expresión booleana que se debe cumplir para iterar y sentencia que es
    ejecuta al final de cada iteración
  + =for each= En cada iteración se toma el siguiente elemento de una
    estructura de datos
  + Python sólo cuenta con el estilo =for each=, aunque es posible
    simular el =estilo C=

    #+begin_src python :session *py* :results output :exports both :tangle /tmp/test.py
      # Forma
      for elemento in estructura:
          sentencias_y_expresiones          
    #+end_src
  
#+begin_src python :session *py* :results output :exports both :tangle /tmp/test.py
  for palabra in ['hola', 'mundo', 'mundial']:
      print(palabra)
#+end_src
#+RESULTS:
: hola
: mundo
: mundial

- Para simular =estilo C= se usa la función especial =range=
- =range= regresa una secuencia de números de acuerdo a sus argumentos


#+begin_src python :session *py* :results output :exports both :tangle /tmp/test.py
  for caracter in 'hola':
    print(caracter)
#+end_src
#+RESULTS:
: h
: o
: l
: a

  #+begin_src python :session *py* :results output :exports both :tangle /tmp/test.py
    lista = ['hola', 'mundo', 'mundial'] # tamaño 3, posiciones del 0 al 2 
    for i in range(len(lista)): # regresa los  números 0, 1 y 2, el 3 es no inclusivo
        print(lista[i])
  #+end_src
#+RESULTS:
: hola
: mundo
: mundial
